Tekla.Structures.Analysis.AnalysisDecomposedLoad.LoadCoordinateEnum
This defines whether local or global coordinates are used for loading the coordinate system.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.LoadCoordinateEnum.USE_LOCAL_COORDINATES
Local coordinates are used.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.LoadCoordinateEnum.USE_GLOBAL_COORDINATES
Global coordinates are used.